class FoodData {
  static Map<String, Map<String, dynamic>> foods = {
    "โจ้ก": {
      "price": 35,
      "lat": 18.28856270279976,
      "lng": 99.49522818720176,
      "video": "assets/videos/joke.mp4",
      "ingredients": ["ไข่ไก่", "ข้าว", "น้ำ"],
      "steps": ["ต้มข้าว", "ตักใส่ถ้วย", "จัดเสิร์ฟ"],
    },
    "ข้าวมันไก่": {
      "price": 40,
      "lat": 18.288566051747306,  
      "lng": 99.49515565287935,
      "video": "assets/videos/chick.mp4",
      "ingredients": ["ไก่", "ข้าว", "น้ำซุป"],
      "steps": ["ต้มไก่", "หุงข้าวกับน้ำซุป", "สับไก่","จัดเสิร์ฟ"],
    },
    "ข้าวหมูกรอบ": {
      "price": 50,
      "lat": 18.287500880493607,  
      "lng": 99.49353090476333,
      "video": "assets/videos/pork.mp4",
      "ingredients": ["ข้าว", "หมูสามชั้น", "น้ำส้มสายชู", "เกลือ"],
      "steps": ["แทงหนังหมู", "แช่น้ำส้มสายชู", "ทาเกลือ","ทอดหมู","จัดเสิร์ฟ"],
    },
    "หมูย่าง": {
      "price": 50,
      "lat": 18.289770785345972,  
      "lng": 99.49585702574336,
      "video": "assets/videos/grill.mp4",
      "ingredients": ["หมู"],
      "steps": ["ย่างหมู","ใส่จาน"],
    },

    // ของหวาน
    "เค้กช็อกโกแลต": {
      "price": 60,
      "lat": 18.283980297720397,   
      "lng": 99.49677065190308,
      "video": "assets/videos/cake.mp4",
      "ingredients": ["แป้งเค้ก", "น้ำตาล", "ผงโกโก้","ผงฟู","นมสด","เนย"],
      "steps": ["ผสมส่วนผสมแห้ง", "ผสมส่วนผสมเปียก", "นำเข้าไมโครเวฟ","นำออกมาพักให้เย็นลง"],
    },
    "บิงซู": {
      "price": 75,
      "lat": 18.318133712798907,   
      "lng": 99.51103987453506,
      "video": "assets/videos/bingsu.mp4",
      "ingredients": ["นมสด", "นมข้น", "ท็อปปิ้ง"],
      "steps": ["ผสมนมสดกับนมข้น", "แช่แข็ง", "ทุบ","จัดเสิร์ฟ"],
    },
    "โรตี": {
      "price": 15,
      "lat": 18.291781458500928,  
      "lng": 99.51416308961748,
      "video": "assets/videos/roll.mp4",
      "ingredients": ["แป้งสารี", "น้ำ", "น้ำตาล","เกลือ","เนย","ไข่ไก่"],
      "steps": ["ผสมน้ำ น้ำตาล ไข่ เกลือ แป้ง เนย", "นวดแป้ง","พักแป้ง","แผ่แป้ง","ทอดแป้ง","เสิร์ฟ"],
    },
  };
}
